In [31]:
import pandas as pd
data=[[45,65,100],[56,None,50],[67,67,67]]
index=['zhang','li','wang']
columns=['数学','语文','英语']
df=pd.DataFrame(data=data,index=index,columns=columns)
df

       数学    语文   英语
zhang  45  65.0  100
li     56   NaN   50
wang   67  67.0   67

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, zhang to wang
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   数学      3 non-null      int64
 1   语文      2 non-null      float64
 2   英语      3 non-null      int64
dtypes: float64(1), int64(2)
memory usage: 96.0+ bytes

In [9]:
df.isnull()

          数学     语文     英语
zhang  False  False  False
li     False   True  False
wang   False  False  False

In [10]:
df[df.isnull()]

       数学  语文  英语
zhang NaN NaN NaN
li    NaN NaN NaN
wang  NaN NaN NaN

In [11]:
df[df.notnull()]

       数学    语文   英语
zhang  45  65.0  100
li     56   NaN   50
wang   67  67.0   67

In [12]:
df.notnull()

         数学     语文    英语
zhang  True   True  True
li     True  False  True
wang   True   True  True

In [13]:
df.dropna()#删除缺失值的行

       数学    语文   英语
zhang  45  65.0  100
wang   67  67.0   67

In [16]:
df[df['语文'].isnull()]

    数学  语文  英语
li  56 NaN  50

In [17]:
df[df['语文'].notnull()]

       数学    语文   英语
zhang  45  65.0  100
wang   67  67.0   67

In [20]:
df1=df['语文'].fillna(0)

In [21]:
df1

zhang    65.0
li        0.0
wang     67.0
Name: 语文, dtype: float64

In [23]:
type(df1)

pandas.core.series.Series

In [25]:
df.fillna(0)#缺失值填充为0

       数学    语文   英语
zhang  45  65.0  100
li     56   0.0   50
wang   67  67.0   67

In [26]:
df.duplicated()#查找重复的值

zhang    False
li       False
wang     False
dtype: bool

In [47]:
df2=df.drop_duplicates()#删除重复的值

In [49]:
df.drop_duplicates((['wang'])) #删除数学有重复的值

       数学  wang    语文   英语
zhang  45  67.0  65.0  100

In [54]:
data=[[56,65,100],[56,None,50],[67,67,67]]
index=['zhang','li','wang']
columns=['数学','语文','英语']
df3=pd.DataFrame(data=data,index=index,columns=columns)
df3

       数学    语文   英语
zhang  56  65.0  100
li     56   NaN   50
wang   67  67.0   67

In [56]:
df3.drop_duplicates(['数学'])#删除了数学的值有重复的内容，只保留第一个

       数学    语文   英语
zhang  56  65.0  100
wang   67  67.0   67

In [59]:
df3.drop_duplicates(['数学'],keep='last')#删除了数学的值有重复的内容，只保留最后一个

      数学    语文  英语
li    56   NaN  50
wang  67  67.0  67